Revit 2026 API

# MetallicPaintMetallicpaintTopcoatGlossy Property

---

The property labeled "Glossiness" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintTopcoatGlossy { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintTopcoatGlossy As String
	Get
```
```cpp
public:
static property String^ MetallicpaintTopcoatGlossy {
	String^ get ();
}
```
```fsharp
static member MetallicpaintTopcoatGlossy : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace